Repository: python/pootle-python-org-backup
Catalog: tmxes/pl/library.tmx
Source language: en
Languages: pl

source: *Polar coordinates* give an alternative way to represent a complex number. In polar coordinates, a complex number *z* is defined by the modulus *r* and the phase angle *phi*. The modulus *r* is the distance from *z* to the origin, while the phase *phi* is the counterclockwise angle, measured in radians, from the positive x-axis to the line segment that joins the origin to *z*.
pl: *Współrzędne polarne* dają alternatywny sposób aby reprezentować liczby zespolone. W polarnych współrzędnych, liczba zespolona *z* jest zdefiniowana przez moduł *r* i kąta fazowego *phi* - z ang. - *fi*. Moduł *r* jest odległością od *z* do początku, podczas gdy faza *phi* jest kątem przeciwnym dla ruchu wskazówek zegara, mierzonym w radianach, od pozytywnej osi-x do segmentu linii łączącej początek układu współrzędnych z *z*.

source: The following functions can be used to convert from the native rectangular coordinates to polar coordinates and back.
pl: Następujące zadania mogą być używane do skonwertowania z natywnych prostokątnych współrzędnych do współrzędnych kołowych i z powrotem.

source: Return the phase of *x* (also known as the *argument* of *x*), as a float. ``phase(x)`` is equivalent to ``math.atan2(x.imag, x.real)``. The result lies in the range [-π, π], and the branch cut for this operation lies along the negative real axis, continuous from above. On systems with support for signed zeros (which includes most systems in current use), this means that the sign of the result is the same as the sign of ``x.imag``, even when ``x.imag`` is zero::
pl: Zwróć fazę *x* (znaną także jako *argument* *x*), jako liczbę zmiennoprzecinkową. ``phase(x)`` jest równoważne ``math.atan2(x.imag, x.real)``. Wynik leży w przedziale [-π, π], i przecięcie odgałęzienia dla tej operacji leży wzdłuż ujemnej rzeczywistej osi, ciągłej z góry. W maszynach/środowiskach które wspierają oznaczone zera (co zawiera większość maszyn/środowisk w obecnym użyciu), to oznacza że znak wyniku jest ten sam jak znak ``x.imag``, nawet gdy ``x.imag`` jest zero::

source: The modulus (absolute value) of a complex number *x* can be computed using the built-in :func:`abs` function. There is no separate :mod:`cmath` module function for this operation.
pl: Moduł (wartość bezwzględna) zespolonej liczby *x* może być obliczony używając wbudowanego zadania :func:`abs`. Nie ma oddzielnego zadania modułu :mod:`cmath` dla tej operacji.

source: Return the representation of *x* in polar coordinates. Returns a pair ``(r, phi)`` where *r* is the modulus of *x* and phi is the phase of *x*. ``polar(x)`` is equivalent to ``(abs(x), phase(x))``.
pl: Zwróć reprezentację *x* w kołowych współrzędnych. Zwróć parę ``(r, phi)`` gdzie *r* jest modułem *x* a phi jest fazą *x*. ``polar(x)`` jest równoważne ``(abs(x), phase(x))``

source: Return the complex number *x* with polar coordinates *r* and *phi*. Equivalent to ``r * (math.cos(phi) + math.sin(phi)*1j)``.
pl: Zwróć liczbę zespoloną *x* z kołowymi współrzędnymi *r* i *phi*. Równoważne ``r * (math.cos(phi) + math.sin(phi)*1j)``.

source: Power and logarithmic functions
pl: Zadania potęgowania i logarytmiczne

source: Return the exponential value ``e**x``.
pl: Zwróć potęgową wartość ``e**x``.

source: Returns the logarithm of *x* to the given *base*. If the *base* is not specified, returns the natural logarithm of *x*. There is one branch cut, from 0 along the negative real axis to -∞, continuous from above.
pl: Zwróć logarytm *x* dla danej *podstawy* - z ang. - *base*. Jeśli *podstawa* - z ang. - *base* nie jest określona, zwróć logarytm naturalny *x*. Jest jedno odgałęzienie ucięte, od 0 wzdłuż ujemnej osi rzeczywistej do -∞, ciągłej od góry.

source: Return the base-10 logarithm of *x*. This has the same branch cut as :func:`log`.
pl: Zwróć logarytm o podstawie dziesiętnej z *x*. To ma tą samą gałąź uciętą jak :func:`log`.

source: Return the square root of *x*. This has the same branch cut as :func:`log`.
pl: Zwróć pierwiastek kwadratowy z *x*. To ma tą samą uciętą gałąź jak :func:`log`.

source: Trigonometric functions
pl: Funkcje trygonometryczne

source: Return the arc cosine of *x*. There are two branch cuts: One extends right from 1 along the real axis to ∞, continuous from below. The other extends left from -1 along the real axis to -∞, continuous from above.
pl: Zwróć arcus cosinus *x*. Są dwa odgałęzienia ucięte: jedna biegnie od 1 wzdłuż rzeczywistej osi do ∞, ciągła od dołu. Druga biegnie od -1 wzdłuż rzeczywistej osi do -∞, ciągła od góry.

source: Return the arc sine of *x*. This has the same branch cuts as :func:`acos`.
pl: Zwróć arcus sinus *x* To ma te same odgałęzienia cięte jak :func:`acos`.

source: Return the arc tangent of *x*. There are two branch cuts: One extends from ``1j`` along the imaginary axis to ``∞j``, continuous from the right. The other extends from ``-1j`` along the imaginary axis to ``-∞j``, continuous from the left.
pl: Zwróć arcus tangens *x*. Są dwa odgałęzienia ucięte: Jedno rozciąga się od ``1j`` wzdłuż osi urojonej do ``∞j``, ciągłe od prawej strony. Druga rozciąga się od ``-1j`` wzdłuż osi urojonej do ``-∞j``, ciągłej od lewej strony.

source: Return the cosine of *x*.
pl: Zwróć cosinus *x*.

source: Return the sine of *x*.
pl: Zwróć sinus *x*.

source: Return the tangent of *x*.
pl: Zwróć tangens *x*.

source: Hyperbolic functions
pl: Funkcje hiperboliczne

source: Return the hyperbolic arc cosine of *x*. There is one branch cut, extending left from 1 along the real axis to -∞, continuous from above.
pl: Zwróć hiperboliczny arcus cosinus *x*. Istnieje jedno odgałęzienie, rozciągające się z lewej strony od 1 wzdłuż osi rzeczywistej do -∞, ciągłej od góry.

source: Return the hyperbolic arc sine of *x*. There are two branch cuts: One extends from ``1j`` along the imaginary axis to ``∞j``, continuous from the right. The other extends from ``-1j`` along the imaginary axis to ``-∞j``, continuous from the left.
pl: Zwróć hiperboliczny arcus sinus *x*. Istnieją dwa odgałęzienia ucięte, jedno rozciąga się od ``1j`` wzdłuż urojonej osi do ``∞j``, ciągłej od prawej strony. Druga rozciąga się od ``-1j`` wzdłuż urojonej osi do ``-∞j``, ciągłej od lewej strony.

source: Return the hyperbolic arc tangent of *x*. There are two branch cuts: One extends from ``1`` along the real axis to ``∞``, continuous from below. The other extends from ``-1`` along the real axis to ``-∞``, continuous from above.
pl: Zwróć hiperboliczny arcus tangens *x*. Istnieją dwie gałęzie: jedna rozciąga się od ``1`` wzdłuż rzeczywistej osi do ``∞``, ciągłej od dołu. Drugi rozciąga się od ``-1`` wzdłuż osi rzeczywistej do ``-∞``, ciągłej od góry.

source: Return the hyperbolic cosine of *x*.
pl: Zwróć hiperboliczny cosinus *x*.

source: Return the hyperbolic sine of *x*.
pl: Zwróć hiperboliczny sinus *x*.

source: Return the hyperbolic tangent of *x*.
pl: Zwróć hiperboliczny tangens *x*.

source: Classification functions
pl: Funkcje klasyfikacyjne

source: Return *True* if the real or the imaginary part of x is positive or negative infinity.
pl: Zwróć *prawdę* - z ang. - *True* jeśli rzeczywista lub urojona część x jest dodatnią lub ujemną nieskończonością.

source: Return *True* if the real or imaginary part of x is not a number (NaN).
pl: Zwróć *prawdę* - z ang. - *True* jeśli rzeczywista lub urojona część x nie jest liczbą (NaN - z ang. not a number)

source: Constants
pl: Stałe

source: The mathematical constant *π*, as a float.
pl: Stała matematyczna *π* jako liczba zmiennoprzecinkowa.

source: The mathematical constant *e*, as a float.
pl: Matematyczna stała *e* jako liczba zmiennoprzecinkowa.

source: Note that the selection of functions is similar, but not identical, to that in module :mod:`math`. The reason for having two modules is that some users aren't interested in complex numbers, and perhaps don't even know what they are. They would rather have ``math.sqrt(-1)`` raise an exception than return a complex number. Also note that the functions defined in :mod:`cmath` always return a complex number, even if the answer can be expressed as a real number (in which case the complex number has an imaginary part of zero).
pl: Zauważ, że wybór zadań jest podobny ale nie identyczny do tej w module :mod:`math`. Powódem posiadania dwóch modułów jest to, że niektórzy użytkownicy nie są zainteresowani liczbami zespolonymi, i być może nie wiedzą nawet że istnieją. Woleliby żeby ``math.sqrt(-1)`` zgłosił wyjątek niż zwróciło liczbę urojoną. Zauważ też że zadania określone w module :mod:`cmath` zawsze zwraca liczbę zespoloną, nawet jeśli odpowiedź może być wyrażona jako liczba rzeczywista (w którym to przypadku liczba zespolona ma część urojoną równą zero).

source: A note on branch cuts: They are curves along which the given function fails to be continuous. They are a necessary feature of many complex functions. It is assumed that if you need to compute with complex functions, you will understand about branch cuts. Consult almost any (not too elementary) book on complex variables for enlightenment. For information of the proper choice of branch cuts for numerical purposes, a good reference should be the following:
pl: Uwaga o cięciach gałęzi: Są to krzywe wzdłuż których dana funkcja nie jest ciągła. Są one konieczną właściwością wielu zespolonych funkcji. Jest zakładane że jeśli potrzebujesz obliczeń z liczbami zespolonymi, to zrozumiałe są cięcia gałęzi. Skonsultuj się prawie z każdą (nie tak podstawową) książką o liczbach zespolonych dla oświecenia. Dla informacji o właściwym wyborze cięć gałęzi dla potrzeb numerycznych, dobrym odniesieniem powinno być następujące:

source: Kahan, W: Branch cuts for complex elementary functions; or, Much ado about nothing's sign bit. In Iserles, A., and Powell, M. (eds.), The state of the art in numerical analysis. Clarendon Press (1987) pp165-211.
pl: Kahan, W: "Branch cuts for complex elementary functions"; lub, Much ado about nothing's sign bit. w Iserles, A. i Powell, M. (eds.), Stan dzieła sztuki w numerycznej analizie. Clarendon Press (1987) pp165-211.

source: :mod:`cmd` --- Support for line-oriented command interpreters
pl: :mod:`cmd` --- Wsparcie dla zorientowanych-na-linię interpreterów poleceń

source: The :class:`Cmd` class provides a simple framework for writing line-oriented command interpreters. These are often useful for test harnesses, administrative tools, and prototypes that will later be wrapped in a more sophisticated interface.
pl: Uogólnienie :class:`Cmd` dostarcza prostych ram dla pisania zorientowanych-na-linię interpretatorów poleceń. Te są często użyteczne dla testów, narzędzi administracyjnych i prototypów, które będą później zapakowane w bardziej zaawansowany sprzęg.

source: A :class:`Cmd` instance or subclass instance is a line-oriented interpreter framework. There is no good reason to instantiate :class:`Cmd` itself; rather, it's useful as a superclass of an interpreter class you define yourself in order to inherit :class:`Cmd`'s methods and encapsulate action methods.
pl: Przykład :class:`Cmd` lub przykład podrzędnego uogólnienia jest zorientowaną na linię ramą programu interpretującego polecenia. Nie ma dobrego powodu aby dawać przykład :class:`Cmd` sam w sobie; raczej jest użyteczne jako nadrzędne uogólnienie uogólnienia programu interpretującego polecenia który definiujesz sam w celu odziedziczenia sposobów postępowania :class:`Cmd` i kapsułkowania sposobów postępowania akcji.

source: The optional argument *completekey* is the :mod:`readline` name of a completion key; it defaults to :kbd:`Tab`. If *completekey* is not :const:`None` and :mod:`readline` is available, command completion is done automatically.
pl: Opcjonalny parametr *completekey* jest nazwą przycisku do kompletowania z modułu :mod:`readline`; domyślnie jest :kbd:`Tab`. Jeśli *completekey* nie jest :const:`None` i :mod:`readline` jest dostępne, kompletowanie poleceń jest dokonywane automatycznie.

source: The optional arguments *stdin* and *stdout* specify the input and output file objects that the Cmd instance or subclass instance will use for input and output. If not specified, they will default to :data:`sys.stdin` and :data:`sys.stdout`.
pl: Opcjonalne parametry *stdin* i *stdout* określa wejściowe i wyjściowe przedmiotów plików których przykłady Cmd lub podrzędnych uogólnień będą używane dla wejścia i wyjścia. Jeśli nie określono, będą one domyślnie równe :data:`sys.stdin` i :data:`sys.stdout`.

source: If you want a given *stdin* to be used, make sure to set the instance's :attr:`use_rawinput` attribute to ``False``, otherwise *stdin* will be ignored.
pl: Jeśli chcesz aby dane *stdin* było używane, upewnij się że ustawisz właściwość :attr:`use_rawinput` na ``False`` - z ang. - ``Fałsz`` w przeciwnym razie *stdin* zostanie zignorowany.

source: Cmd Objects
pl: Przedmioty Cmd

source: A :class:`Cmd` instance has the following methods:
pl: Przykłady :class:`Cmd` mają następujące sposoby postępowania:

source: Repeatedly issue a prompt, accept input, parse an initial prefix off the received input, and dispatch to action methods, passing them the remainder of the line as argument.
pl: Powtarzając wysyłaj zapytanie, akceptuj wpisy wejściowe, wczytuj początkowe przedrostki otrzymanego wejścia i rozkładaj do sposobów postępowania akcji, przekazując im pozostałą część linii jako parametr.

source: The optional argument is a banner or intro string to be issued before the first prompt (this overrides the :attr:`intro` class member).
pl: Opcjonalny parametr jest bannerem lub ciągiem znaków wprowadzającym do wystosowania przed pierwszym zapytaniem o polecenie (to obchodzi właściwość :attr:`intro` - członka uogólnienia).

source: If the :mod:`readline` module is loaded, input will automatically inherit :program:`bash`\ -like history-list editing (e.g. :kbd:`Control-P` scrolls back to the last command, :kbd:`Control-N` forward to the next one, :kbd:`Control-F` moves the cursor to the right non-destructively, :kbd:`Control-B` moves the cursor to the left non-destructively, etc.).
pl: Jeśli moduł :mod:`readline` jest załadowany, wejście automatycznie odziedziczy podobny do :program:`bash`\-a sposób edycji list-historii (np. :kbd:`Control-P` przewija wstecz do ostatniej komendy, :kbd:`Control-N` przejście wprzód do następnego, :kbd:`Control-F` przesunięcie kursora do prawej strony nie-destrukcyjnie, :kbd:`Control-B` przesunięcie kursora do lewej strony nie-destrukcyjnie, itd.).

source: An end-of-file on input is passed back as the string ``'EOF'``.
pl: Koniec-pliku na wejściu jest przekazywany jako ciąg ``'EOF'``.

source: An interpreter instance will recognize a command name ``foo`` if and only if it has a method :meth:`do_foo`. As a special case, a line beginning with the character ``'?'`` is dispatched to the method :meth:`do_help`. As another special case, a line beginning with the character ``'!'`` is dispatched to the method :meth:`do_shell` (if such a method is defined).
pl: Przykład programu interpretującego będzie rozpoznawał nazwę komendy ``foo`` wtedy i tylko wtedy gdy ma on sposób postępowania :meth:`do_foo`. Jako szczególny przypadek, początek wiersza ze znakiem ``'?'`` jest przesyłany do sposobu postępowania :meth:`do_help`. Jako następny szczególny przypadek, początek linii ze znakiem ``'!'`` jest przesyłany do sposobu postępowania :meth:`do_shell` (jeśli taki sposób postępowania jest zdefiniowany).

source: This method will return when the :meth:`postcmd` method returns a true value. The *stop* argument to :meth:`postcmd` is the return value from the command's corresponding :meth:`do_\*` method.
pl: Ten sposób postępowania będzie powracał gdy sposób postępowania :meth:`postcmd` zwróci wartość prawdy. Parametr *stop* dla sposobu postępowania :meth:`postcmd` jest wartością zwracaną z odpowiadającego sposobu postępowania :meth:`do_\*`.

source: If completion is enabled, completing commands will be done automatically, and completing of commands args is done by calling :meth:`complete_foo` with arguments *text*, *line*, *begidx*, and *endidx*. *text* is the string prefix we are attempting to match: all returned matches must begin with it. *line* is the current input line with leading whitespace removed, *begidx* and *endidx* are the beginning and ending indexes of the prefix text, which could be used to provide different completion depending upon which position the argument is in.
pl: Jeśli kompletowanie jest włączone kompletowanie komend będzie wykonywane automatycznie i kompletowanie parametrów komend jest dokonywane przez wywołanie :meth:`complete_foo` z parametrami *text*, *line*, *begidx*, i *endidx*. *text* jest ciągiem przedrostka który mamy zamiar dopasować: wszystkie zwracane dopasowania muszą zaczynać się od niego. *line* jest obecną linią wprowadzaną ze zdjętymi prowadzącymi białymi znakami, *begidx* i *endidx* są początkowymi i końcowymi indeksami tekstu przedrostka, które mogą być użyte do zapewnienia różnych uzupełnień w zależności od tego w której pozycji parametr się znalazł.

source: All subclasses of :class:`Cmd` inherit a predefined :meth:`do_help`. This method, called with an argument ``'bar'``, invokes the corresponding method :meth:`help_bar`. With no argument, :meth:`do_help` lists all available help topics (that is, all commands with corresponding :meth:`help_\*` methods), and also lists any undocumented commands.
pl: Wszystkie podrzędne uogólnienia :class:`Cmd` dziedziczą uprzednio zdefiniowany sposób postępowania :meth:`do_help`. Ten sposób postępowania wywołany z parametrem ``'bar'``, wywołuje odpowiadający sposób postępowania :meth:`help_bar`. Bez parametru :meth:`do_help` wypisuje wszystkie dostępne tematy pomocy (to jest, wszystkie polecenia z odpowiadającymi sposobami postępowania :meth:`help_\*`), a także wypisuje wszystkie nieudokumentowane polecenia.

source: Interpret the argument as though it had been typed in response to the prompt. This may be overridden, but should not normally need to be; see the :meth:`precmd` and :meth:`postcmd` methods for useful execution hooks. The return value is a flag indicating whether interpretation of commands by the interpreter should stop. If there is a :meth:`do_\*` method for the command *str*, the return value of that method is returned, otherwise the return value from the :meth:`default` method is returned.
pl: Interpretuj parametr tak jakby został wprowadzony w odpowiedzi na zapytanie. To może być przesłonięte, ale nie powinno normalnie być; zobacz sposoby postępowania :meth:`precmd` i :meth:`postcmd` dla użytecznych haczyków wykonania. Wartość zwracana jest flagą wskazującą czy interpretacja poleceń przez program interpretujący powinna się zakończyć. Jeśli istnieje sposób postępowania :meth:`do_\*` dla polecenia *str*, wartość zwracana z tego sposobu postępowania jest zwracana, w przeciwnym przypadku wartość zwracana ze sposobu postępowania :meth:`default` jest zwracana.

source: Method called when an empty line is entered in response to the prompt. If this method is not overridden, it repeats the last nonempty command entered.
pl: Sposób postępowania wywoływany wtedy gdy pusty wiersz jest wprowadzany w odpowiedzi na zapytanie. Jeśli ten sposób postępowania nie jest przesłonięty, powtarza on ostatnią niepustą komendę wprowadzoną.

source: Method called on an input line when the command prefix is not recognized. If this method is not overridden, it prints an error message and returns.
pl: Sposób postępowania wywoływany na linii wprowadzanej gdy przedrostek polecenia jest nierozpoznany. Jeśli ten sposób postępowania nie jest przesłonięty, drukuje on wiadomość o błędzie i powraca.

source: Method called to complete an input line when no command-specific :meth:`complete_\*` method is available. By default, it returns an empty list.
pl: Sposób wywoływany w celu uzupełnienia linii wejściowej gdy żadne szczególne-dla-polecenia sposoby postępowania :meth:`complete\*` nie są dostępne. Domyślnie, zwraca pustą listę.

source: Hook method executed just before the command line *line* is interpreted, but after the input prompt is generated and issued. This method is a stub in :class:`Cmd`; it exists to be overridden by subclasses. The return value is used as the command which will be executed by the :meth:`onecmd` method; the :meth:`precmd` implementation may re-write the command or simply return *line* unchanged.
pl: Sposób postępowania - hak - wykonywany dokładnie przed tym, jak wiersz poleceń *linia* jest interpretowany, ale po tym jak zapytanie wejściowe jest wygenerowane i przekazane. Ten sposób postępowania jest zrębem w :class:`Cmd`; istnieje po to aby być przesłanianym przez podrzędne uogólnienia. Wartość zwracana jest używana jako polecenie, które będzie wykonane przez sposób postępowania :meth:`onecmd`; wypełnienie sposobu postępowania :meth:`precmd` może ponownie zapisywać polecenie lub po prostu zwracać *linię* bez zmian.

source: Hook method executed just after a command dispatch is finished. This method is a stub in :class:`Cmd`; it exists to be overridden by subclasses. *line* is the command line which was executed, and *stop* is a flag which indicates whether execution will be terminated after the call to :meth:`postcmd`; this will be the return value of the :meth:`onecmd` method. The return value of this method will be used as the new value for the internal flag which corresponds to *stop*; returning false will cause interpretation to continue.
pl: Sposób postępowania - hak - wykonywany tuż po tym jak wydawanie polecenia jest zakończone. Ten sposób postępowania jest zrębem w uogólnieniu :class:`Cmd`; istnieje aby być przesłanianym przez podrzędne uogólnienia. *Linia* jest poleceniem które zostało wykonane, i *stop* jest flagą która wskazuje czy wykonanie zostanie zakończone po wywołaniu sposobu postępowania :meth:`postcmd`; to będzie wartość zwracana sposobu postępowania :meth:`onecmd`. Wartość zwracana tego sposobu postępowania będzie używana jako nowa wartość dla wewnętrznej flagi która odpowiada *stop*; zwracanie fałszu będzie powodowało, że interpretacja pójdzie naprzód.

source: Hook method executed once when :meth:`cmdloop` is called. This method is a stub in :class:`Cmd`; it exists to be overridden by subclasses.
pl: Sposób postępowania hak wykonywany raz gdy :meth:`cmdloop` jest wywoływany. Ten sposób postępowania jest zrębem w uogólnieniu :class;`Cmd`; istnieje aby być przesłaniany przez podrzędne uogólnienia.

source: Hook method executed once when :meth:`cmdloop` is about to return. This method is a stub in :class:`Cmd`; it exists to be overridden by subclasses.
pl: Sposób postępowania - hak - wykonywany raz gdy sposób postępowania :meth:`cmdloop` jest gotowa do powrotu. Ten sposób postępowania jest zrębem w uogólnieniu :class:`Cmd`; istnieje aby być przesłanianym przez podrzędne uogólnienia.

source: Instances of :class:`Cmd` subclasses have some public instance variables:
pl: Przykłady uogólnienia podrzędnego względem uogólnienia :class:`Cmd` mają pewne publiczne zmienne przykładu:

source: The prompt issued to solicit input.
pl: Zapytanie wypuszczone aby pobrać wejście.

source: The string of characters accepted for the command prefix.
pl: Ciąg znaków akceptowany za przedrostek polecenia.

source: The last nonempty command prefix seen.
pl: Niepusty przedrostek polecenia widziany ostatnio.

source: A string to issue as an intro or banner. May be overridden by giving the :meth:`cmdloop` method an argument.
pl: Ciąg znaków do przekazania jako ciąg wprowadzający lub banner. Może być przesłonięty przez podanie parametru dla sposobu postępowania :meth:`cmdloop`.

source: The header to issue if the help output has a section for documented commands.
pl: Nagłówek do przekazania jeśli wyjście pomocy ma rozdział dla udokumentowanych poleceń.
